# FamilyStructuralMaterialTypeFilter Properties

---
The FamilyStructuralMaterialTypeFilter type exposes the following members.
| Name| Description
---|---|---
| Inverted|  True if the results of the filter are inverted; elements that would normally be accepted by this filter will be rejected, and elements that would normally be rejected will be accepted. (Inherited from ElementFilter)
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity. (Inherited from ElementFilter)
| StructuralMaterialType|  The family structural material type.
Top
#### Reference
FamilyStructuralMaterialTypeFilter Class
Autodesk.Revit.DB.Structure Namespace